In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("sales.csv")

In [4]:
df

,Order_ID,Customer_Name,Gender,Age,City,Product_Category,Quantity,Price,Order_Date,Payment_Method,Rating
0,1001,NaN,F,22,mumbai,electronic,1.0,abc,05-01-2024,UPI,1.0
1,1002,Pooja,m,120,NaN,Clothing,4.0,67000,13-04-2024,UPI,2.0
2,1003,Anjali,Male,21,NaN,Electronics,3.0,NaN,18-03-2024,Card,1.0
3,1004,Vikas,Female,120,Delhi,electronic,3.0,45000,31-03-2024,UPI,1.0
4,1005,Akash,F,45,NaN,Furniture,4.0,NaN,21-01-2024,Card,3.0
...,...,...,...,...,...,...,...,...,...,...,...
610,1011,Vikas,M,39,mumbai,electronic,3.0,NaN,15-01-2024,Card,4.0
611,1012,Rohit,f,120,PUNE,Clothing,5.0,1500,21-04-2024,Card,NaN
612,1013,Pooja,m,120,Mumbai,electronic,3.0,999999,03-01-2024,UPI,3.0
613,1014,Kiran,m,20,mumbai,Clothng,1.0,25000,17-01-2024,cash,5.0
614,1015,Rohit,Female,120,PUNE,Clothing,NaN,67000,21-02-2024,Card,4.0

In [5]:
df["Gender"]= df["Gender"].replace({"Male":"M","Female":"F"})
df

,Order_ID,Customer_Name,Gender,Age,City,Product_Category,Quantity,Price,Order_Date,Payment_Method,Rating
0,1001,NaN,F,22,mumbai,electronic,1.0,abc,05-01-2024,UPI,1.0
1,1002,Pooja,m,120,NaN,Clothing,4.0,67000,13-04-2024,UPI,2.0
2,1003,Anjali,M,21,NaN,Electronics,3.0,NaN,18-03-2024,Card,1.0
3,1004,Vikas,F,120,Delhi,electronic,3.0,45000,31-03-2024,UPI,1.0
4,1005,Akash,F,45,NaN,Furniture,4.0,NaN,21-01-2024,Card,3.0
...,...,...,...,...,...,...,...,...,...,...,...
610,1011,Vikas,M,39,mumbai,electronic,3.0,NaN,15-01-2024,Card,4.0
611,1012,Rohit,f,120,PUNE,Clothing,5.0,1500,21-04-2024,Card,NaN
612,1013,Pooja,m,120,Mumbai,electronic,3.0,999999,03-01-2024,UPI,3.0
613,1014,Kiran,m,20,mumbai,Clothng,1.0,25000,17-01-2024,cash,5.0
614,1015,Rohit,F,120,PUNE,Clothing,NaN,67000,21-02-2024,Card,4.0

In [6]:
df.describe()

          Order_ID    Quantity      Rating
count   615.000000  515.000000  514.000000
mean   1293.365854    2.924272    3.052529
std     177.074823    1.456267    1.442587
min    1001.000000    1.000000    1.000000
25%    1139.500000    2.000000    2.000000
50%    1293.000000    3.000000    3.000000
75%    1446.500000    4.000000    4.000000
max    1600.000000    5.000000    5.000000

In [7]:
df['Price']=pd.to_numeric(df['Price'],errors="coerce")                           
df['Price']=df['Price'].fillna(df['Price'].median())
df

,Order_ID,Customer_Name,Gender,Age,City,Product_Category,Quantity,Price,Order_Date,Payment_Method,Rating
0,1001,NaN,F,22,mumbai,electronic,1.0,45000.0,05-01-2024,UPI,1.0
1,1002,Pooja,m,120,NaN,Clothing,4.0,67000.0,13-04-2024,UPI,2.0
2,1003,Anjali,M,21,NaN,Electronics,3.0,45000.0,18-03-2024,Card,1.0
3,1004,Vikas,F,120,Delhi,electronic,3.0,45000.0,31-03-2024,UPI,1.0
4,1005,Akash,F,45,NaN,Furniture,4.0,45000.0,21-01-2024,Card,3.0
...,...,...,...,...,...,...,...,...,...,...,...
610,1011,Vikas,M,39,mumbai,electronic,3.0,45000.0,15-01-2024,Card,4.0
611,1012,Rohit,f,120,PUNE,Clothing,5.0,1500.0,21-04-2024,Card,NaN
612,1013,Pooja,m,120,Mumbai,electronic,3.0,999999.0,03-01-2024,UPI,3.0
613,1014,Kiran,m,20,mumbai,Clothng,1.0,25000.0,17-01-2024,cash,5.0
614,1015,Rohit,F,120,PUNE,Clothing,NaN,67000.0,21-02-2024,Card,4.0

In [8]:
df["Customer_Name"]=df["Customer_Name"].str.strip()

In [14]:
df["Customer_Name"].value_counts()

Customer_Name
Kiran       46
Rahul       46
Rohit       44
Priya       43
Riya        42
Akash       41
Neha        40
Om          38
Vikas       36
Harshada    34
Pooja       34
Meena       32
Sneha       29
Anjali      29
Amit        28
Sameer      27
Name: count, dtype: int64

In [15]:
df["Customer_Name"].isna().sum()

np.int64(26)

In [16]:
df=df.dropna(subset=["Customer_Name"])
df

,Order_ID,Customer_Name,Gender,Age,City,Product_Category,Quantity,Price,Order_Date,Payment_Method,Rating
1,1002,Pooja,m,120,NaN,Clothing,4.0,67000.0,13-04-2024,UPI,2.0
2,1003,Anjali,M,21,NaN,Electronics,3.0,45000.0,18-03-2024,Card,1.0
3,1004,Vikas,F,120,Delhi,electronic,3.0,45000.0,31-03-2024,UPI,1.0
4,1005,Akash,F,45,NaN,Furniture,4.0,45000.0,21-01-2024,Card,3.0
5,1006,Pooja,f,38,Nagpur,Clothing,5.0,45000.0,21-01-2024,cash,4.0
...,...,...,...,...,...,...,...,...,...,...,...
610,1011,Vikas,M,39,mumbai,electronic,3.0,45000.0,15-01-2024,Card,4.0
611,1012,Rohit,f,120,PUNE,Clothing,5.0,1500.0,21-04-2024,Card,NaN
612,1013,Pooja,m,120,Mumbai,electronic,3.0,999999.0,03-01-2024,UPI,3.0
613,1014,Kiran,m,20,mumbai,Clothng,1.0,25000.0,17-01-2024,cash,5.0
614,1015,Rohit,F,120,PUNE,Clothing,NaN,67000.0,21-02-2024,Card,4.0